#include <stdio.h>
int main(){
    int num[5] = {5,4,3,2,1};
    printf("num[1] = %d\n", num[1]); /* จะมีค่าเท่ากับ 1 เพราะ อยู่ในลำดับที่ 1 */
    printf("num[4] = %d\n", num[4]);/* จะมีค่าเท่ากับ 1 เพราะ อยู่ในลำดับที่ 4 */
    printf("num[ num[4]] = %d\n", num[ num[4]]);/* จะมีค่าเท่ากับ 4 เพราะ num[4] = 1 เราจึงสามมารถแทน 1 ที่ num[4]ได้เลย 
    จากนั้นมันกลายเป็น num[1] จึงมีค่าเท่ากับ 4 */
    printf("num[1] + num[3] = %d\n", num[1] + num[3]);/*num[1] อยู่ในลำดับที่ 1 = 4 + num[3] ที่อยู่ในลำดับที่ 3 = 2 
    ดังนั้น จะได้ผลลัพท์ 4 + 2 = 6 */
    printf("num[ num[4] ] + num[ num[2] ] = %d", num[ num[4] ] + num[ num[2] ]);/*จะมีค่าเท่ากับ 6 เพราะ num[4] = 1 
    เราจึงสามมารถแทน 1 ที่ num[4]ได้เลย จากนั้นมันกลายเป็น num[1] จึงมีค่าเท่ากับ 4 ส่วน num[2] = 3 เราสามารถแทน 3 ที่ num[2] ได้เลย 
    มันปลายเป็น num[3] = 2 และนำค่าทั้งสองมาบอกกัน  = 4 + 2 = 6  */
    return 0;
}